<a href="https://colab.research.google.com/github/Ellie2499/db_course/blob/main/Thiri_Moe_Htet_12214682__Week11_HW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3

# Create a database connection
conn = sqlite3.connect('students.db')
c = conn.cursor()

# Create the "student" table if it doesn't exist
c.execute("""CREATE TABLE IF NOT EXISTS student (
    id INTEGER PRIMARY KEY,
    name TEXT,
    class TEXT,
    mark INTEGER,
    sex TEXT
)""")

# Student data
student_data = [
    (1, 'John Deo', 'Four', 75, 'female'),
    (2, 'Max Ruin', 'Three', 85, 'male'),
    (3, 'Arnold', 'Three', 55, 'male'),
    (4, 'Krish Star', 'Four', 60, 'female'),
    (5, 'John Mike', 'Four', 60, 'female'),
    (6, 'Alex John', 'Four', 55, 'male'),
    (7, 'My John Rob', 'Five', 78, 'male'),
    (8, 'Asruid', 'Five', 85, 'male'),
    (9, 'Tes Qry', 'Six', 78, 'male'),
    (10, 'Big John', 'Four', 55, 'female'),
    (11, 'Ronald', 'Six', 89, 'female'),
    (27, 'Big Nose', 'Three', 81, 'female'),
    (28, 'Rojj Base', 'Seven', 86, 'female'),
    (29, 'Tess Played', 'Seven', 55, 'male'),
    (30, 'Reppy Red', 'Six', 79, 'female'),
    (31, 'Marry Toeey', 'Four', 88, 'male'),
    (32, 'Binn Rott', 'Seven', 90, 'female'),
    (33, 'Kenn Rein', 'Six', 96, 'female'),
    (34, 'Gain Toe', 'Seven', 69, 'male'),
    (35, 'Rows Noump', 'Six', 88, 'female')
]

# Insert data into the "student" table
c.executemany("INSERT INTO student (id, name, class, mark, sex) VALUES (?, ?, ?, ?, ?)", student_data)

# Commit the changes
conn.commit()

# Retrieve and print the contents of the "student" table
c.execute("SELECT * FROM student")
rows = c.fetchall()

print("Contents of the 'student' table:")
for row in rows:
    print(row)

# Calculate and print the grade distribution
c.execute("""SELECT
                CASE
                    WHEN mark < 60 THEN 'E'
                    WHEN mark < 70 THEN 'D'
                    WHEN mark < 80 THEN 'C'
                    WHEN mark < 90 THEN 'B'
                    WHEN mark < 100 THEN 'A'
                    ELSE 'F'
                END AS status,
                COUNT(ID)
            FROM student
            GROUP BY status;""")

results = c.fetchall()

print("\nGrade Distribution:")
for row in results:
    print(row)

# Close the connection
conn.close()

Contents of the 'student' table:
(1, 'John Deo', 'Four', 75, 'female')
(2, 'Max Ruin', 'Three', 85, 'male')
(3, 'Arnold', 'Three', 55, 'male')
(4, 'Krish Star', 'Four', 60, 'female')
(5, 'John Mike', 'Four', 60, 'female')
(6, 'Alex John', 'Four', 55, 'male')
(7, 'My John Rob', 'Five', 78, 'male')
(8, 'Asruid', 'Five', 85, 'male')
(9, 'Tes Qry', 'Six', 78, 'male')
(10, 'Big John', 'Four', 55, 'female')
(11, 'Ronald', 'Six', 89, 'female')
(27, 'Big Nose', 'Three', 81, 'female')
(28, 'Rojj Base', 'Seven', 86, 'female')
(29, 'Tess Played', 'Seven', 55, 'male')
(30, 'Reppy Red', 'Six', 79, 'female')
(31, 'Marry Toeey', 'Four', 88, 'male')
(32, 'Binn Rott', 'Seven', 90, 'female')
(33, 'Kenn Rein', 'Six', 96, 'female')
(34, 'Gain Toe', 'Seven', 69, 'male')
(35, 'Rows Noump', 'Six', 88, 'female')

Grade Distribution:
('A', 2)
('B', 7)
('C', 4)
('D', 3)
('E', 4)